Revit 2027 API
BuiltInFailures.AnalyticalModelFailures.StructWallAnalyticalErrorConversion Property
 Can't convert Edges to Analytical Model curves.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId StructWallAnalyticalErrorConversion { get; }
Public Shared ReadOnly Property StructWallAnalyticalErrorConversion As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ StructWallAnalyticalErrorConversion {
	FailureDefinitionId^ get ();
}
static member StructWallAnalyticalErrorConversion : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.AnalyticalModelFailures Class
Autodesk.Revit.DB Namespace